Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionFormatAttributes Constructor
 Creates a new dimension format attributes instance. By default the format rounds the dimension value to the nearest whole and shows it with no decimals. The unit is selected automatically.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionFormatAttributes()
Public Sub New
See Also
Reference
DimensionSetBaseAttributes.DimensionFormatAttributes Class
DimensionSetBaseAttributes.DimensionFormatAttributes Overload
Tekla.Structures.Drawing Namespace